<h2>找出五百年內的閏年</h2>
<ul>
<li>請依照閏年公式找出五百年內的閏年</li>
<li>使用陣列來儲存閏年</li>
<li>使用迴圈來印出閏年</li>
</ul>

<?php
$year=[];

for($i=2023;$i<2523;$i++){
    if(($i%4==0 && $i%100 !=0) || $i %400 ==0){
        $year[]=$i;
}

}

foreach($year as $key=> $year){
    echo $year." , ";
}



?>

<h2>已知西元1024年為甲子年，請設計一支程式，可以接受任一西元年份，輸出對應的天干地支的年別。(利用迴圈)</h2>
<?php
$year=1997;
$sky=['甲','乙','丙','丁','戊','己','庚','辛','壬','癸',];
$land=['子','丑','寅','卯','辰','巳','午','未','申','酉','戌','亥',];

echo "西元" .$year. "是";
echo $sky[($year-1024)%10];
echo $land[($year-1024)%12];
echo "年";


?>